{
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "displayName": "Windows Custom Compliance",
    "description": "Checks Manufacturer, Firewall, Malware and Bitlocker",
    "roleScopeTagIds": [
        "0"
    ],
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "passwordRequiredType": "deviceDefault",
    "scheduledActionsForRule": [
        {
            "ruleName": "PasswordRequired",
            "scheduledActionConfigurations": [
                {
                    "actionType": "block",
                    "gracePeriodHours": 0,
                    "notificationMessageCCList": [],
                    "notificationTemplateId": ""
                }
            ]
        }
    ],
    "deviceCompliancePolicyScript": null
}
